snlkuharlocal/src/Documents/Инвентаризация/Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвентаризация</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.СертификатныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.Партии</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладВременногоХранения</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПересчитыватьСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОприходования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПартии</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Им7</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтукВКоробе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Партии/Партии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Партии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.КонтрактыСПроизводителем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/СертификатныеОстатки/СертификатныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СертификатныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.ПодарочныеСертификаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидСклада/ВидСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСклада</name>
  <enumValues>
    <name>Физический</name>
  </enumValues>
  <enumValues>
    <name>Виртуальный</name>
  </enumValues>
  <enumValues>
    <name>ВиртуальныйДляСклада</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Инвентаризация/ObjectModule.bsl
#Область ОписаниеПеременных
Перем НачСостНакладной;
Перем РегистрироватьИзменения;
//нечаева 23,09,16++
Перем ЕстьИзмДоПроведения;
//нечаева 23,09,16--
//++Данилова Е.В. 30.06.2026 Изм.№0000000174
Перем СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне;
//--Данилова Е.В. 30.06.2026 
#КонецОбласти

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда
		Возврат;
	КонецЕсли
	;
	//---Чирков Свертка.

	НачСостНакладной	=Ссылка.СостояниеНакладной;	
	//Кухарь 10.12.15 начало
	//Запрет создание документов по виртуальным складам в ЦО
		//крохин начало 29.12.2018
	//разрешим проводить обработкой
	//крохин начало 17.12.2018
	//временно, до получения разрешения на создание документом, разрешим грузить в ЦО, чтобы не вешать обмен
	//если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
    //если НЕ ОбменДанными.Загрузка И Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
	Если Не ПараметрыСеанса.ЗапущенаОбработка И Не ОбменДанными.Загрузка И Склад.ВидСклада
		= Перечисления.ВидСклада.ВиртуальныйДляСклада И ПараметрыСеанса.ТипУзла
		= Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//крохин конец 17.12.2018	
	//крохин конец 29.12.2018

#Если Клиент Тогда
		Сообщить("В ЦО запрещено создание документов по виртуальным складам");
#КонецЕсли
		отказ=Истина;
	КонецЕсли
	;
	//Кухарь 10.12.15 конец

	
	//Мессерле
#Если Клиент Тогда
	Если Не обменданными.Загрузка Тогда
		Если склад.ТипСклада = перечисления.ТипСклада.ВнешнийСклад И СостояниеНакладной
			<> Перечисления.СостоянияНакладной.Отгружена И РежимЗаписи = режимзаписидокумента.Проведение Тогда
			Если докоснование <> ссылка Тогда
				Предупреждение("Провести можно только в статусе 'Отгружена'");
				Отказ=Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;

		Если товары.Итог("КоличествоФакт") - товары.Итог("КоличествоРасч") <> товары.Итог("Количество")
			И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена И РежимЗаписи
			= режимзаписидокумента.Проведение Тогда
			Если докоснование <> ссылка Тогда
				Предупреждение("Отклонение не равно разности : КоличествоРасчетное-КоличествоФактическое!");
				Отказ=Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

#КонецЕсли
	//Мессерле

	Если ЭтоНовый() И Организация.Пустая() И Не Склад.Пустая() И Не Склад.Организация.Пустая() Тогда
		Организация=Склад.Организация;
	КонецЕсли;

	ЕстьИзменения	= Модифицированность();
	
	//нечаева 23,09,16++
	Если ЕстьИзмДоПроведения Тогда
		ЕстьИзменения = Истина;
		РегистрироватьИзменения = Истина;
	КонецЕсли;	
	//нечаева 23,09,16--

	НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения, Ссылка, РежимЗаписи, ПометкаУдаления);

	Если Не ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект, Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект, Отказ, РежимЗаписи, Истина);
		МожноИзменятьДокумент(ЭтотОбъект, Отказ, Истина);

		Если Отказ Тогда
			Возврат;
		КонецЕсли
		;

		Если Ссылка.СостояниеНакладной <> Перечисления.СостоянияНакладной.ВРаботе И ПараметрыСеанса.ЭтотУзел.ТипУзла
			= Перечисления.ТипУзлаИБ.УправляющееПодразделение И ЕстьИзменения
			И Не ПараметрыСеанса.ОтключитьКонтрольРезервов Тогда
			ЗаписатьВЛог("Изм. отгр. накл.", "" + Номер + " " + Дата, "Важное");
		КонецЕсли;
	КонецЕсли;

	Если ЕстьИзменения Тогда
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);

		ПроверитьСоответствиеЗаявке(ЭтотОбъект);
		// Кухарь А.Ю. 09.09.2024 начало
		ТребуетсяМаркировка=МаркировкаКС.ОпределитьЗначениеТребуетсяМаркировкаВДокументе(ЭтотОбъект, , , Истина); 
		// Кухарь А.Ю. 09.09.2024 конец

	КонецЕсли;

	Если РегистрироватьИзменения И НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//нечаева 23,09,16++
		ЕстьИзмДоПроведения = Истина;
		//нечаева 23,09,16--	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	ДвиженияПоРегистрам=Неопределено;

	ТС=Неопределено;
	//в состоянии "сканирование" не делаем в офисе никаких движений, чтобы не корректировать остатки
	Если СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена И ПараметрыСеанса.ЭтотУзел.ТипУзла
		= Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Возврат;
	КонецЕсли;
	
	//ИНВ из ЦО_ФР не делают проводок, выгружаются СПН и ОПР
	Если НеФормироватьПроводки Тогда
		Возврат;
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если Не ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Не ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка, ДвиженияПоРегистрам, ОбменДанными.Загрузка, ТС);
	Результат=РезультатПроведения["Результат"];

	Если НеПересчитыватьСуммы = Ложь Тогда
		ТДВО=ДвиженияПоРегистрам.ОстаткиТМЦ.Скопировать();
		ТДВО.Свернуть("Номенклатура", "Количество,Сумма,ВидДвижения");

		Для Каждого СтрокаТО Из ТДВО Цикл
			СтрокиТЧ=Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТО.Номенклатура));
			Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
				Если СтрокаТО.Количество <> 0 Тогда
					СтрокаТЧ.Всего=СтрокаТЧ.Количество * СтрокаТО.Сумма / СтрокаТО.Количество;
				КонецЕсли;
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект, "ОтВсего");
			КонецЦикла;
		КонецЦикла;

		Для Каждого СтрокаТЧ Из Товары Цикл
			Если СтрокаТЧ.Количество = 0 И СтрокаТЧ.Всего <> 0 Тогда
				СтрокаТЧ.Всего=0;
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект, "ОтВсего");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	РегистрироватьИзменения=Ложь;

	Записать(); 
	
	//++Данилова Е.В. 30.06.2026 Изм.№0000000174 
	//при записи из-за перезаписи здесь не получается проверить версию данных
	Если СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне Тогда   		
		ИдентификаторФЗ = Новый УникальныйИдентификатор();
		Документы.Инвентаризация.СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне(ссылка, ЭтотОбъект.ВерсияДанных, ИдентификаторФЗ); 
	КонецЕсли;
	//--Данилова Е.В. 30.06.2026

	Если Результат < 0 Тогда
		Отказ=Не (ПолучитьПолномочиеПользователя("СписыватьВМинус"));

		ВывестиТрассировку(РезультатПроведения["ТОшибок"], ?(Отказ, -2, Результат));
	КонецЕсли;

	Если Не Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам, ОбменДанными.Загрузка);
	КонецЕсли;

	Если СуммаДокумента <> 0 Тогда
		ВалютаДокумента=?(Дата >= '20090101', ПараметрыСеанса.ВалютаУпр_2009, ПараметрыСеанса.ВалютаУпр);

		Движение=Движения.Затраты.Добавить();

		Движение.Период			= Дата;

		Движение.Подразделение	= Склад.Подразделение;
		Движение.СтатьяЗатрат	= СтатьяЗатрат;
		
		//крохин начало 05.12.2019
		Движение.СубЗатрата = СубЗатрата;
		//крохин конец 05.12.2019

		Если СуммаДокумента > 0 Тогда
			Движение.СуммаУпр		= СуммаДокумента;
			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
		Иначе
			Движение.СуммаУпр		= -СуммаДокумента;
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
		КонецЕсли;

		Движение.СуммаДокумента		= СуммаДокумента;
		Движение.ВалютаДокумента	= ВалютаДокумента;
		
		//крохин начало
		Движение.Комментарий        = Комментарий;
		//крохин конец
		Движение.ДатаЗаписи			= ТекущаяДата();

		Если ОбменДанными.Загрузка Тогда
			Движения.Затраты.Записать();
		КонецЕсли;
	КонецЕсли;	
	
	
	//Мессерле-партии
	Если склад.ТипСклада = перечисления.ТипСклада.ВнешнийСклад Тогда
		Для Каждого стр Из ТоварыПартии Цикл
			Если Стр.КоличествоФакт <> Стр.КоличествоРасч И ЗначениеЗаполнено(стр.номенклатура) Тогда

				Если Стр.ШтукВКоробе = 0 И дата >= '20110727' Тогда
					Сообщить("Не заполнено поле 'Штук в коробе'!");
					Отказ=Истина;
					Возврат;
				КонецЕсли;

				Движение = Движения.Партии.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Партия = стр.Им7;
				Движение.Период = Дата;
				Движение.Номенклатура = стр.Номенклатура;
				Движение.Склад = Склад;
				Движение.ШтВКоробе=Стр.ШтукВКоробе;
				Движение.Количество = Стр.КоличествоФакт - Стр.КоличествоРасч;
				//коэф=Движение.Количество/Стр.КоличествоФакт;
				Движение.Сумма = Стр.СуммаФакт - Стр.СуммаРасч;
				//движение.Вес=Стр.ВесБрутто;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
	//Мессерле
	Если ТоварыПартии.Количество() > 0 Тогда
		Если докоснование <> ссылка Тогда
			//Если по партиям просто пересорт, то  можно проводить без товаров. Иногда может совпасть!
			Если (ТоварыПартии.Итог("КоличествоФакт") - ТоварыПартии.Итог("КоличествоРасч") <> Товары.Итог(
				"КоличествоФакт") - Товары.Итог("КоличествоРасч") И Товары.Количество() <> 0) Тогда
				сообщить("Разные отклонения количества в товарах и партиях.Не проводим!");
				Отказ=Истина;
			КонецЕсли;

			Если (ТоварыПартии.Итог("КоличествоФакт") <> ТоварыПартии.Итог("КоличествоРасч") И Товары.Количество() = 0
				И Дата > '20120101') Тогда   //Впредь для устранения косяков такого рода использовать коррекцию партий, а не инв. -Мессерле
				сообщить(
					"При пересортице партий (ИМ7,Шт. в коробе).Количество факт. должно быть равно колич.расчетному!");
				Отказ=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Не Отказ И ОбменДанными.Загрузка Тогда
		Движения.Партии.Записать();
	КонецЕсли; 
	
		//кухарь учет сертификатов 11.09.13 начало
	Если Не УчетСертификатов.ПровестиДокументПоСертификатнымОстаткам(ЭтотОбъект) Тогда
		отказ=Истина;
	КонецЕсли;
	//кухарь учет сертификатов 11.09.13 конец
	
	//кухарь 22.07.14 начало	
	Если ОбменДанными.Загрузка Тогда
		Движения.СертификатныеОстатки.Записать();
	КонецЕсли;
//кухарь 22.07.14 конец	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли
	;
	Если Основание = Неопределено Или Основание.Пустая() Тогда
		Возврат;
	КонецЕсли
	;

	ВидОснования	= Основание.Метаданные().Имя;

	ВариантЗаполнения="Целиком";
	
	//ВариантЗаполнения=ВыбратьВариантЗаполнения();
	//Если ВариантЗаполнения=Неопределено Тогда
	//	ВариантЗаполнения="Целиком";
	//КонецЕсли;	

	ДокОснование	= Основание;

	ИБ				= Основание.ИБ;

	Контрагент 		= ПолучитьРеквизитОбъекта(ДокОснование, "Контрагент");
	Договор			= ПолучитьРеквизитОбъекта(ДокОснование, "Договор");
	ЛевыйКонтрагент = ПолучитьРеквизитОбъекта(ДокОснование, "ЛевыйКонтрагент");
	ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование, "ПунктДоставки");
	Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование, "Менеджер");

	БанковскийСчет	= ПолучитьРеквизитОбъекта(ДокОснование, "БанковскийСчет");
	ОтсрочкаПлатежа = ПолучитьРеквизитОбъекта(ДокОснование, "ОтсрочкаПлатежа");
	ВидОплаты		= ПолучитьРеквизитОбъекта(ДокОснование, "ВидОплаты");

	Организация		= ПолучитьРеквизитОбъекта(ДокОснование, "Организация");
	Склад			= ПолучитьРеквизитОбъекта(ДокОснование, "Склад");

	ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование, "ГруппыТоваров");

	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование, "ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование, "ТипСкидок");
	Скидка			= ПолучитьРеквизитОбъекта(ДокОснование, "Скидка");

	ТранспортнаяКомпания = ПолучитьРеквизитОбъекта(ДокОснование, "ТранспортнаяКомпания");

	Если ВидОснования = "ПриходнаяНакладная" И Не ПолучитьПолномочиеПользователя("ВидимостьПриходныхЦен") Тогда
		ОбнулитьЦены=Истина;
	Иначе
		ОбнулитьЦены=Ложь;
	КонецЕсли;

	КолонкаКоличества=?(ВидОснования = "Перемещение", "ПодтвержденнаяЗаявка", "Количество");
	Если ВариантЗаполнения = "РазницаСНабором" Тогда
		Форма=Обработки.СравнениеЛистовНабора.ПолучитьФорму();
		Форма.Документ		=ДокОснование;

		РезультатСравнения	=Форма.ПолучитьОшибкиНабора();
		ТН					=РезультатСравнения.ТН;

		Дата				=ДокОснование.Дата;
		ДатаОтгрузки		=Дата;

		Комментарий		= "Недостача по ";
	Иначе
		Комментарий		= "";
	КонецЕсли;

	Комментарий=Комментарий + ДокОснование.Метаданные() + " № " + ДокОснование.Номер + " от " + Формат(
		ДокОснование.Дата, "ДФ=dd.MM.yy");

	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		СтрокаТЧ = Товары.Добавить();

		ЗаполнитьЗначенияСвойств(СтрокаТЧ, исхСтрокаТЧ, , "Количество,Цена");

		СтрокаТЧ.КоличествоРасч	=исхСтрокаТЧ[КолонкаКоличества];
		СтрокаТЧ.КоличествоФакт	=0;
		СтрокаТЧ.Количество		=-исхСтрокаТЧ[КолонкаКоличества];

		Если СтрокаТЧ.КоличествоРасч = 0 Тогда
			Товары.Удалить(СтрокаТЧ);
		Иначе
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Организация			=Неопределено;
	СостояниеНакладной	=Неопределено;
	Отгружен			=Неопределено;
	СостояниеДокументов	=Неопределено;
	ДатаОтгрузки		=Неопределено;

	Автор				=Неопределено;
	//крохин начало 11.08.2022
	НеФормироватьПроводки = Неопределено;
	//крохин конец 11.08.2022
КонецПроцедуры

//кухарь учет сертификатов 11.09.13 начало
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда
		Возврат;
	КонецЕсли
	;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если Не ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Не ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	УчетСертификатов.УдалениеКомментариевСписанныхСертификатов(ЭтотОбъект);
КонецПроцедуры

//кухарь учет сертификатов 11.09.13 конец

Процедура ПриЗаписи(Отказ)
	//++Данилова Е.В. 30.06.2026 Изм.№0000000174
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат; 
	КонецЕсли;
	
	Если НачСостНакладной <> СостояниеНакладной И документы.Инвентаризация.НеобходимоСоздатьОПР_СПН(ссылка)
		И Дата >= Дата(2026,07,01) Тогда
		
		СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне = Истина; 
		//ИдентификаторФЗ = Новый УникальныйИдентификатор();
		//Документы.Инвентаризация.СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне(ссылка, ЭтотОбъект.ВерсияДанных, ИдентификаторФЗ); 
	КонецЕсли;
	//--Данилова Е.В. 30.06.2026 
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам, Записывать = Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;

		Если Движения.Найти(ИмяРегистра) = Неопределено Тогда
			Возврат;
		КонецЕсли
		;

		НаборЗаписей=Движения[ИмяРегистра];
		НаборЗаписей.Очистить();

		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Движение);

			Запись.Регистратор=Ссылка;
		КонецЦикла;

		Если Записывать Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Инициализация
ЗаписьБезКонтроля		=Ложь;
РегистрироватьИзменения	=Истина;
//нечаева 23,09,16++
ЕстьИзмДоПроведения = Ложь;
//нечаева 23,09,16--
//++Данилова Е.В. 30.06.2026 Изм.№0000000174
СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне = Ложь; 
//--Данилова Е.В. 30.06.2026
#КонецОбласти
